------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/yinuozhang/Dropbox/Personal/Midstory/rust belt/stata/cleaning.log
  log type:  text
 opened on:  16 Jul 2022, 18:00:45

. cd "$work"
/Users/yinuozhang/Dropbox/Personal/Midstory/rust belt/stata

. use "$work/cleaning.dta", clear

. 
. desc

Contains data from /Users/yinuozhang/Dropbox/Personal/Midstory/rust belt/stata/cleaning.dta
  obs:     6,771,228                          
 vars:            16                          16 Jul 2022 18:00
 size:   406,273,680                          
------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------
year            int     %8.0g      year_lbl   Census year
sample          long    %40.0g     sample_lbl
                                              IPUMS sample identifier
serial          double  %8.0f                 Household serial number
hhwt            double  %10.2f                Household weight
cluster         double  %13.0f                Household cluster for variance estimation
statefip        byte    %57.0g     statefip_lbl
                                              State (FIPS code)
strata          double  %12.0f                Household strata for variance estimation
gq              byte    %43.0g     gq_lbl     Group quarters status
pernum          int     %8.0g                 Person number in sample unit
perwt           double  %10.2f                Person weight
empstat         byte    %18.0g     empstat_lbl
                                              Employment status [general version]
empstatd        byte    %38.0g     empstatd_lbl
                                              Employment status [detailed version]
labforce        byte    %26.0g     labforce_lbl
                                              Labor force status
ind1990         int     %62.0g     ind1990_lbl
                                              Industry, 1990 basis
wkswork1        byte    %8.0g                 Weeks worked last year
incwage         long    %12.0g                Wage and salary income
------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. 
. *******************************************************************
. * Keep only private sector workers
. * From Alder etal 21
. *******************************************************************
. 
. *******************************************************************
. * identify manufacture workers
. *******************************************************************
. * Feryer etal: primary metals (33) and transportation (37), respec- tively. The bulk of the employment in these SICs falls w
> ithin the steel and auto industries, as seen by looking at the four-digit industries within SICs 33 and 37, which are summar
> ized in appendix A.
. * SIC 33: as late as 1993, 70 per- cent of total employment was within steel and iron foundries, steel rolling mills, and st
> eel and iron pipe factories.
. * SIC 37: the bulk of employment was directly in the production of cars, trucks, buses, and motor homes.
. *******************************************************************
. gen nondurb = 0

. /* replace manu = 1 if (ind1990 == 270) | /// * Blast furnaces, steelworks, rolling and finishing mills
> (ind1990 == 271) | /// * Iron and steel foundries
> (ind1990 == 272) | /// * primary aluminum industries
> (ind1990 == 280) | /// * Other primary metal industries
> (ind1990 == 281) | /// * Cutlery, handtools, and general hardware
> (ind1990 == 282) | /// * Fabricated structural metal products
> (ind1990 == 291) | /// * Metal forgings and stampings
> (ind1990 == 292) | /// * Ordnance
> (ind1990 == 300) | /// * Misc fabricated metal products
> (ind1990 == 301)  /* Metal industries, n.s.*/
> */
. 
. * nondurable + mining + construction
. replace nondurb = 1 if (ind1990 >= 40) & (ind1990<= 222)
(529,038 real changes made)

. 
. gen durb = 0

. /* replace equip = 1 if (ind1990 == 310) | /// * Engines and turbines
> (ind1990 == 311) | /// * Farm machinery and equipment
> (ind1990 == 312) | /// * Construction and material handling machines
> (ind1990 == 320) | /// * Metalworking machineary
> (ind1990 == 351) | /// * Motor vehicles and motor vehicle equipment
> (ind1990 == 361)  /* Railroad locomotives and equipment */
> */
. 
. * durable
. replace durb = 1 if (ind1990 >=230) & (ind1990 <= 350)
(273,426 real changes made)

. * “Mining” or “Extractive industries” or “Manufacturing” or “Construction”. From growth and structural transformation handbo
> ok chapter, Appendix A on sector assignments
. *******************************************************************
. * identify rustbelt region
. * Indiana, Illinois, Michigan, New York, Ohio, Wisconsin, Pennsylvania, and West Virginia
. * Definition coming from Alder etal 21
. *******************************************************************
. gen rb = 0

. replace rb = 1 if (statefip == 17 ) | /// * Indiana
> (statefip == 18) | /// * Illinois
> (statefip == 26) | /// * Michigan
> (statefip == 36) | /// * New York
> (statefip == 39) | /// * Ohio
> (statefip == 55) | /// * Wisconsin
> (statefip == 42) | /// * Pennsylvania
> (statefip == 54) /* West Virginia */
(2,220,274 real changes made)

. 
. * drop
. drop if (empstatd == 0) | /// * N/A
> (empstatd == 13) | /// * Armed forces
> (empstatd == 14) | /// * Armed forces--at work
> (empstatd == 15) /* Armed forces--not at work but with job */
(1,858,353 observations deleted)

. gen empl = 0

. replace empl = 1 if empstat == 1
(2,702,004 real changes made)

. 
. 
. * collapse by perwt
. collapse (sum) perwt, by(year rb nondurb durb empstat)

. gsort year empstat nondurb durb rb

. * only keeping the employeed
. keep if empstat == 1
(36 observations deleted)

. 
. * drop if (empstat != 1) & (nondurb!= 0 | durb!= 0)
. * bysort year: egen pop_national = total(perwt)
. * bysort year rb: egen pop_total = total(perwt)
. bysort year empstat: egen pop_by_empstat = total(perwt)

. bysort year empstat rb: egen pop_by_empstat_rb = total(perwt)

. 
. gen pop_nondurb = perwt if nondurb == 1
(12 missing values generated)

. bysort year rb: egen pop_nondurb_and_durb = total(perwt) if (nondurb == 1 | durb == 1)
(6 missing values generated)

. 
. drop perwt durb

. 
. * only keep the sector specifics numbers to empstat == 1
. gsort year rb empstat pop_nondurb

. bysort year rb: replace pop_nondurb = pop_nondurb[_n-1] if empstat == 1 & missing(pop_nondurb)
(12 real changes made)

. replace pop_nondurb = 0 if missing(pop_nondurb)
(0 real changes made)

. 
. gsort year rb empstat pop_nondurb_and_durb

. bysort year rb: replace pop_nondurb_and_durb = pop_nondurb_and_durb[_n-1] if empstat == 1 & missing(pop_nondurb_and_durb)
(6 real changes made)

. replace pop_nondurb_and_durb = 0 if missing(pop_nondurb_and_durb)
(0 real changes made)

. duplicates drop

Duplicates in terms of all variables

(6 observations deleted)

. gsort year rb empstat

. order year rb empstat nondurb

. 
. reshape wide pop*, i(year rb empstat) j(nondurb)
(note: j = 0 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       12   ->       6
Number of variables                   8   ->      11
j variable (2 values)           nondurb   ->   (dropped)
xij variables:
                         pop_by_empstat   ->   pop_by_empstat0 pop_by_empstat1
                      pop_by_empstat_rb   ->   pop_by_empstat_rb0 pop_by_empstat_rb1
                            pop_nondurb   ->   pop_nondurb0 pop_nondurb1
                   pop_nondurb_and_durb   ->   pop_nondurb_and_durb0 pop_nondurb_and_durb1
-----------------------------------------------------------------------------

. drop *1

. * rename (pop_national0 pop_total0 pop_by_empstat0 pop_manu0 pop_manu_and_equip0) (pop_national pop_total pop_by_empstat pop
> _manu pop_manu_and_equip)
. rename ( pop_by_empstat0 pop_by_empstat_rb0 pop_nondurb0 pop_nondurb_and_durb0) ( pop_by_empstat pop_by_empstat_rb pop_nondu
> rb pop_nondurb_and_durb)

. 
. drop if empstat != 1
(0 observations deleted)

. bysort year: egen pop_nondurb_national = total(pop_nondurb)

. bysort year: egen pop_nondurb_durb_national = total(pop_nondurb_and_durb)

. gen nondurb_r_nation = pop_nondurb_national/pop_by_empstat

. gen nondurb_durb_r_nation = pop_nondurb_durb_national/pop_by_empstat

. 
. gen nondurb_r_rb = pop_nondurb/pop_by_empstat_rb if rb == 1
(3 missing values generated)

. gen nondurb_durb_r_rb = pop_nondurb_and_durb/pop_by_empstat_rb if rb == 1
(3 missing values generated)

. 
. tab year nondurb_durb_r_nation

    Census |      nondurb_durb_r_nation
      year |  .1860656   .2667235   .3020383 |     Total
-----------+---------------------------------+----------
      1950 |         0          0          2 |         2 
      1970 |         0          2          0 |         2 
      2000 |         2          0          0 |         2 
-----------+---------------------------------+----------
     Total |         2          2          2 |         6 


. tab year nondurb_durb_r_rb

    Census |        nondurb_durb_r_rb
      year |  .1933083   .2912261    .347831 |     Total
-----------+---------------------------------+----------
      1950 |         0          0          1 |         1 
      1970 |         0          1          0 |         1 
      2000 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |         1          1          1 |         3 


. 
. tab year nondurb_r_nation

    Census |         nondurb_r_nation
      year |  .1268813   .1615995   .1985349 |     Total
-----------+---------------------------------+----------
      1950 |         0          0          2 |         2 
      1970 |         0          2          0 |         2 
      2000 |         2          0          0 |         2 
-----------+---------------------------------+----------
     Total |         2          2          2 |         6 


. tab year nondurb_r_rb

    Census |           nondurb_r_rb
      year |  .1210107    .150396   .2012501 |     Total
-----------+---------------------------------+----------
      1950 |         0          0          1 |         1 
      1970 |         0          1          0 |         1 
      2000 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |         1          1          1 |         3 


. 
. drop empstat pop*

. 
. gsort year -rb

. bysort year: replace nondurb_r_rb = nondurb_r_rb[_n-1] if missing(nondurb_r_rb)
(3 real changes made)

. 
. bysort year: replace nondurb_durb_r_rb = nondurb_durb_r_rb[_n-1] if missing(nondurb_durb_r_rb)
(3 real changes made)

. 
. drop rb

. duplicates drop

Duplicates in terms of all variables

(3 observations deleted)

. keep year *_durb_*

. 
. rename (nondurb_durb_r_nation nondurb_durb_r_rb) (nationalRate rustbeltRate)

. 
. outsheet using "$work/output.csv", comma replace

. 
. log close
      name:  <unnamed>
       log:  /Users/yinuozhang/Dropbox/Personal/Midstory/rust belt/stata/cleaning.log
  log type:  text
 closed on:  16 Jul 2022, 18:00:53
------------------------------------------------------------------------------------------------------------------------------
